# Created by shenping at 2020/5/9
Feature: 获取翠友天地热门话题接口测试用例

  Background: 测试数据初始化
    * 运行以下sql,删除测试数据
    """
      "delete from  `operatemanagetest`.`op_content_topic` where id =8 or id =22;"
    """
    * 运行以下sql,base测试数据
    """
      "INSERT INTO `operatemanagetest`.`op_content_topic`(`id`, `topic`, `description`, `cover`, `logo`, `start_time`, `end_time`, `active`, `sort`, `created_at`, `updated_at`, `deleted_at`, `del_state`) VALUES (8, '最美买家秀', '翡翠A货：纯天然翡翠。只经过传统温和的表面酸或表面墩蜡处理，其翡翠的结构未受到腐蚀和破坏。翡翠B货：翡翠在加工过程中经过了人工的化学处理，通过酸浸漂白，墩蜡处理来达到去除杂质、去肮点的效果，翡翠内部结构受到很大程度的破坏。翡翠C货：为染色翡翠。不管酸浸漂白与否，充胶与否，人工加色的翡翠称C货。配戴通过化学处理过的B货、C货翡翠对人体会造成潜在的危害。\n而更让人沮丧的是，不少翠友花了A货的价钱却只买了B货或C货的翡翠，一戴多年却浑然不知。当前翡翠造假手段层出不穷，就算是老行家仅凭肉眼有时候也无法分辨翡翠的真假，所以当你对身边的翡翠有任何疑虑时，最好将翡翠送到专业的鉴定机构做鉴别', 'https://res.jaadee.net/cuiyou/images/2019-12-10/1575948330102-2fd2fe2507e6d824de8bf7289b81f44c.jpg', 'https://res.jaadee.net/cuiyou/images/2019-12-10/1575948323114-11abc2d1b48b10e402db519e6b7ba528.jpg', 1575907200, 1607529600, 1, 1, '2019-12-10 11:27:01', '2020-05-09 09:49:06', NULL, 0);"
    """
    * 运行以下sql,base 测试数据
    """
      "INSERT INTO `operatemanagetest`.`op_content_topic`(`id`, `topic`, `description`, `cover`, `logo`, `start_time`, `end_time`, `active`, `sort`, `created_at`, `updated_at`, `deleted_at`, `del_state`) VALUES (22, '吊坠的重生', '翡翠A货：纯天然翡翠。只经过传统温和的表面酸或表面墩蜡处理，其翡翠的结构未受到腐蚀和破坏。翡翠B货：翡翠在加工过程中经过了人工的化学处理，通过酸浸漂白，墩蜡处理来达到去除杂质、去肮点的效果，翡翠内部结构受到很大程度的破坏。翡翠C货：为染色翡翠。不管酸浸漂白与否，充胶与否，人工加色的翡翠称C货。配戴通过化学处理过的B货、C货翡翠对人体会造成潜在的危害。\n而更让人沮丧的是，不少翠友花了A货的价钱却只买了B货或C货的翡翠，一戴多年却浑然不知。当前翡翠造假手段层出不穷，就算是老行家仅凭肉眼有时候也无法分辨翡翠的真假，所以当你对身边的翡翠有任何疑虑时，最好将翡翠送到专业的鉴定机构做鉴别', 'https://res.jaadee.net/cuiyou/images/2019-12-10/1575948330102-2fd2fe2507e6d824de8bf7289b81f44c.jpg', 'https://res.jaadee.net/cuiyou/images/2019-12-10/1575948323114-11abc2d1b48b10e402db519e6b7ba528.jpg', 1575907200, 1607529600, 1, 2, '2019-12-10 11:31:38', '2020-05-09 09:49:20', NULL, 0);"
    """

  Scenario: [0]获取热门话题
    * 请求"query_community_topic_list_url"接口，查询
    """
      {'link_url':'',
        'http_method': 'get',
        'evn':'CI_OP',
         'url_params':{
         }
      }
    """
    * 接口返回码"200"
    * 验证接口返回值
    """
      {
          "status": 0,
          "code": 0,
          "msg": "获取列表成功",
          "message": "获取列表成功",
          "info": [{
              "id": 8,
              "topic": "最美买家秀",
              "description": "翡翠A货：纯天然翡翠。只经过传统温和的表面酸或表面墩蜡处理，其翡翠的结构未受到腐蚀和破坏。翡翠B货：翡翠在加工过程中经过了人工的化学处理，通过酸浸漂白，墩蜡处理来达到去除杂质、去肮点的效果，翡翠内部结构受到很大程度的破坏。翡翠C货：为染色翡翠。不管酸浸漂白与否，充胶与否，人工加色的翡翠称C货。配戴通过化学处理过的B货、C货翡翠对人体会造成潜在的危害。\n而更让人沮丧的是，不少翠友花了A货的价钱却只买了B货或C货的翡翠，一戴多年却浑然不知。当前翡翠造假手段层出不穷，就算是老行家仅凭肉眼有时候也无法分辨翡翠的真假，所以当你对身边的翡翠有任何疑虑时，最好将翡翠送到专业的鉴定机构做鉴别",
              "logo": "https:\/\/res.jaadee.net\/cuiyou\/images\/2019-12-10\/1575948323114-11abc2d1b48b10e402db519e6b7ba528.jpg",
              "cover": "https:\/\/res.jaadee.net\/cuiyou\/images\/2019-12-10\/1575948330102-2fd2fe2507e6d824de8bf7289b81f44c.jpg",
              "startTime": 1575907200,
              "endTime": 1607529600,
              "views": 1245
          }, {
              "id": 22,
              "topic": "吊坠的重生",
              "description": "翡翠A货：纯天然翡翠。只经过传统温和的表面酸或表面墩蜡处理，其翡翠的结构未受到腐蚀和破坏。翡翠B货：翡翠在加工过程中经过了人工的化学处理，通过酸浸漂白，墩蜡处理来达到去除杂质、去肮点的效果，翡翠内部结构受到很大程度的破坏。翡翠C货：为染色翡翠。不管酸浸漂白与否，充胶与否，人工加色的翡翠称C货。配戴通过化学处理过的B货、C货翡翠对人体会造成潜在的危害。\n而更让人沮丧的是，不少翠友花了A货的价钱却只买了B货或C货的翡翠，一戴多年却浑然不知。当前翡翠造假手段层出不穷，就算是老行家仅凭肉眼有时候也无法分辨翡翠的真假，所以当你对身边的翡翠有任何疑虑时，最好将翡翠送到专业的鉴定机构做鉴别",
              "logo": "https:\/\/res.jaadee.net\/cuiyou\/images\/2019-12-10\/1575948323114-11abc2d1b48b10e402db519e6b7ba528.jpg",
              "cover": "https:\/\/res.jaadee.net\/cuiyou\/images\/2019-12-10\/1575948330102-2fd2fe2507e6d824de8bf7289b81f44c.jpg",
              "startTime": 1575907200,
              "endTime": 1607529600,
              "views": 3025
          }],
          "data": [{
              "id": 8,
              "topic": "最美买家秀",
              "description": "翡翠A货：纯天然翡翠。只经过传统温和的表面酸或表面墩蜡处理，其翡翠的结构未受到腐蚀和破坏。翡翠B货：翡翠在加工过程中经过了人工的化学处理，通过酸浸漂白，墩蜡处理来达到去除杂质、去肮点的效果，翡翠内部结构受到很大程度的破坏。翡翠C货：为染色翡翠。不管酸浸漂白与否，充胶与否，人工加色的翡翠称C货。配戴通过化学处理过的B货、C货翡翠对人体会造成潜在的危害。\n而更让人沮丧的是，不少翠友花了A货的价钱却只买了B货或C货的翡翠，一戴多年却浑然不知。当前翡翠造假手段层出不穷，就算是老行家仅凭肉眼有时候也无法分辨翡翠的真假，所以当你对身边的翡翠有任何疑虑时，最好将翡翠送到专业的鉴定机构做鉴别",
              "logo": "https:\/\/res.jaadee.net\/cuiyou\/images\/2019-12-10\/1575948323114-11abc2d1b48b10e402db519e6b7ba528.jpg",
              "cover": "https:\/\/res.jaadee.net\/cuiyou\/images\/2019-12-10\/1575948330102-2fd2fe2507e6d824de8bf7289b81f44c.jpg",
              "startTime": 1575907200,
              "endTime": 1607529600,
              "views": 1245
          }, {
              "id": 22,
              "topic": "吊坠的重生",
              "description": "翡翠A货：纯天然翡翠。只经过传统温和的表面酸或表面墩蜡处理，其翡翠的结构未受到腐蚀和破坏。翡翠B货：翡翠在加工过程中经过了人工的化学处理，通过酸浸漂白，墩蜡处理来达到去除杂质、去肮点的效果，翡翠内部结构受到很大程度的破坏。翡翠C货：为染色翡翠。不管酸浸漂白与否，充胶与否，人工加色的翡翠称C货。配戴通过化学处理过的B货、C货翡翠对人体会造成潜在的危害。\n而更让人沮丧的是，不少翠友花了A货的价钱却只买了B货或C货的翡翠，一戴多年却浑然不知。当前翡翠造假手段层出不穷，就算是老行家仅凭肉眼有时候也无法分辨翡翠的真假，所以当你对身边的翡翠有任何疑虑时，最好将翡翠送到专业的鉴定机构做鉴别",
              "logo": "https:\/\/res.jaadee.net\/cuiyou\/images\/2019-12-10\/1575948323114-11abc2d1b48b10e402db519e6b7ba528.jpg",
              "cover": "https:\/\/res.jaadee.net\/cuiyou\/images\/2019-12-10\/1575948330102-2fd2fe2507e6d824de8bf7289b81f44c.jpg",
              "startTime": 1575907200,
              "endTime": 1607529600,
              "views": 3025
          }]
      }
    """